In [100]:
import pandas as pd

# Import la.data.64.County and la.area

The Local Area Unemployment Statistics (LAUS) program produces monthly estimates for Census regions and divisions, states (plus DC and Puerto Rico), metropolitan and micropolitan statistical areas, all counties, and cities with a population of 25,000 or more. You can access these estimates using the database tools at https://www.bls.gov/lau/data.htm. 

See https://download.bls.gov/pub/time.series/la/

To connect the county names, you can connect the series_id field in the county file with the same field in the “la.series” file, then use the area_code field in that file to connect to the “la.area” file, which contains the area names in the area_text field. Alternatively, since the area code is embedded within the series_id, you can remove the “LAU” from the front of the series id and the last two digits (03, 04, 05, or 06) from the end (giving you, for example, CN0100100000000). You can then directly connect that resulting area code to the area_code field in the “la.area” file. 

Month 13 (M13) is the annual average. M01 through M12 are January-December, as you would expect.

The last two digits are the measure codes:

03 – unemployment rate

04 – unemployment (level)

05 – employment

06 – labor force

In [101]:
url_1 = 'https://download.bls.gov/pub/time.series/la/la.area'
url_2 = 'https://download.bls.gov/pub/time.series/la/la.data.64.County'

In [102]:
la_area = pd.read_csv(url_1, sep='\t', dtype=None)

In [103]:
la_data_64_County = pd.read_csv(url_2, sep='\t', dtype=str)
la_data_64_County.columns = ['series_id', 'year', 'period', 'value', 'footnote_codes']

In [104]:
la_area.head()

,area_type_code,area_code,area_text,display_level,selectable,sort_sequence
0,A,ST0100000000000,Alabama,0,T,1
1,A,ST0200000000000,Alaska,0,T,146
2,A,ST0400000000000,Arizona,0,T,188
3,A,ST0500000000000,Arkansas,0,T,252
4,A,ST0600000000000,California,0,T,378

In [105]:
la_data_64_County.head()

                        series_id  year period         value footnote_codes
0  LAUCN010010000000003            1990    M01           6.4            NaN
1  LAUCN010010000000003            1990    M02           6.6            NaN
2  LAUCN010010000000003            1990    M03           5.8            NaN
3  LAUCN010010000000003            1990    M04           6.6            NaN
4  LAUCN010010000000003            1990    M05           6.0            NaN

In [106]:
la_area.dtypes

area_type_code    object
area_code         object
area_text         object
display_level      int64
selectable        object
sort_sequence      int64
dtype: object

In [107]:
la_data_64_County.dtypes

series_id         object
year              object
period            object
value             object
footnote_codes    object
dtype: object

In [108]:
la_data_64_County["year"]= la_data_64_County["year"].astype(str) 
la_data_64_County["value"]= la_data_64_County["value"].astype(str)

In [111]:
la_area.to_stata('la_area.dta')
la_area.to_csv('la_area.csv')

In [112]:
la_data_64_County.to_stata('la_data_64_County.dta')
la_data_64_County.to_csv('la_data_64_County.csv')